# Summer Olympics Data Analysis Assignment

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
df = pd.read_csv('summer.csv')

### 1. In how many cities Summer Olympics is held so far?

In [ ]:
data = df["City"].unique()

In [69]:
len(data)

22762

### 2. Which sport is having most number of Gold Medals so far? (Top 5)

In [9]:
data = []
for Gold in df['Sport'].unique():
  data.append([Gold , len(df[df['Sport'] == Gold])])

data = pd.DataFrame(data, columns = ['Sport','Gold'])

data.sort_values(by = 'Gold', ascending = True).head()
data.head()

        Sport  Gold
0    Aquatics  4170
1   Athletics  3638
2     Cycling  1105
3     Fencing  1613
4  Gymnastics  2307

### 3. Which sport is having most number of medals so far? (Top 5)

In [7]:
data = []
for Medal in df['Sport'].unique():
  data.append([Medal , len(df[df['Sport'] == Medal])])

data = pd.DataFrame(data, columns = ['Sport','Medal'])

data.sort_values(by = 'Medal', ascending = False).head()
data.head()

        Sport  Medal
0    Aquatics   4170
1   Athletics   3638
2     Cycling   1105
3     Fencing   1613
4  Gymnastics   2307

### 4. Which player has won most number of medals? (Top 5)

In [ ]:
data = []
for Medal in df['Athlete'].unique():
  data.append([Medal , len(df[df['Athlete'] == Medal])])

data = pd.DataFrame(data, columns = ['Athlete','Medal'])

data.sort_values(by = 'Medal', ascending = True).head()
data.head()

              Athlete  Medal
0       HAJOS, Alfred      2
1    HERSCHMANN, Otto      2
2   DRIVAS, Dimitrios      1
3  MALOKINIS, Ioannis      1
4  CHASAPIS, Spiridon      1

### 5. Which player has won most number Gold Medals of medals? (Top 5)

In [ ]:
data = []
for Gold in df['Athlete'].unique():
  data.append([Gold , len(df[df['Athlete'] == Gold])])

data = pd.DataFrame(data, columns = ['Athlete','Medal'])

data.sort_values(by = 'Medal', ascending = True).head()
data.head()

              Athlete  Medal
0       HAJOS, Alfred      2
1    HERSCHMANN, Otto      2
2   DRIVAS, Dimitrios      1
3  MALOKINIS, Ioannis      1
4  CHASAPIS, Spiridon      1

### 6. In which year India won first Gold Medal in Summer Olympics?

In [ ]:
data = []
for IND in df['Country'].unique():
  data.append([IND , len(df[df['Country'] == IND])])

data = pd.DataFrame(data, columns = ['Country','Medal'])

data.sort_values(by = 'Medal', ascending = False)
data.head()

### 7. Which event is most popular in terms on number of players? (Top 5)

In [65]:
df['Sport'].max()
data = []
for Sport in df['Athlete'].unique():
  data.append([Sport , len(df[df['Athlete'] == Sport])])

data = pd.DataFrame(data, columns = ['Sport','Athlete'])

data.sort_values(by = 'Athlete', ascending = True).head()
data.head()

                Sport  Athlete
0       HAJOS, Alfred        2
1    HERSCHMANN, Otto        2
2   DRIVAS, Dimitrios        1
3  MALOKINIS, Ioannis        1
4  CHASAPIS, Spiridon        1

### 8. Which sport is having most female Gold Medalists? (Top 5)

In [56]:
data = []
for Women in df['Gender'].unique():
  data.append([Medal , len(df[df['Gender'] == Women])])
  
data = pd.DataFrame(data, columns = ['Women','Gold'])

data.sort_values(by = 'Gold', ascending = False)
data.head()

   Women   Gold
0  Canoe  22746
1  Canoe   8419